[
    [
        "Задача 1. (Ярослав Лисняк) \nФункция полезности потребителя можно задать как: U(x, y) = lnx + y\nУ него есть 99 копеек, на которые он покупает X и Y. Цена p_y = 1 рублей. Выведите спрос на продукцию x. Cколько товара X потребитель купит при цене p_x = 5 рублей? В ответ запишите только число.",
        "0.198"
    ],
    [
        "Задача 2. (Иван Дедюхин) \nГосподин Шнур собирается в тур по городам России. Он нанимает для выступлений девушек на подтанцовки и музыкальные инструменты, которые будет разбивать об сцену. Предложение труда девушек задается уравнением L_s=w. Предложение музыкальных инструментов задается уравнением K_s=r. Шнур — очень известный исполнитель, поэтому является монополистом на обоих рынках. \nДля проведения концертов Шнур используется две технологии. Первая — петь старые известные песни и тогда качество концерта будет задаваться уравнением: Q = max(K, L/2). Вторая технология — петь новые долбанутые песни и тогда качество концерта в зависимости от девушек и музыкальных инструментов будет задаваться уравнением: Q = max(K/2, L). Найдите сумму значений функцию издержек Шнура при Q = 6 и Q = 8(то есть, сколько ему придется потратить на девушек и на инструменты, если он хочет провести концерт качества Q). ",
        "50"
    ],
    [
        "Задача 3. (Арсений Бекбулатов) \nПо мотивам книги А.Карениной \"Капитанская дочка\"\nТри товарища: Бух, Бек и Лис, решили отправиться в путешествие. Для полноценного путешестивия им не хватает лодки и собаки. Собака имеется у Лиса, а лодку следует купить. Бек нормальный, Лис - странный, а Бух - халявщик, поэтому их функции спроса на лодку описываются следующими функциями:\nP_{Бек}=10-Q;  P_{Лис}=4/Q^2;  Q_{Бух}=0\nГде Q – это качество купленной лодки. Заметим, что на покупку лодки скидываются все вместе (ну кроме Буха, конечно).\nЛодку было решено купить у предприимчивой пары Эриха и Марии, которые просекли ярое желание товарищей купить лодку и поэтому действуют, как монополисты. Издержек на производство лодки предприниматели не несут, но за каждую единичку качества лодки Эрих и Мария должны заплатить 5Q единичек в государственный бюджет (странный налог, но какой есть).\nНайдите, лодку какого качества купят товарищи.",
        "1"
    ],
    [
        "Задача 4. (Ярослав Лисняк) \nОдин специфичный предприниматель каким-то образом украл 2√30 долларов. Он обязан их всех потратить в ближайшем будущем, чтобы их не отследили. Тратит он их на покупку труда и капитала для производства. Цены труда и капитала равны единице. Производственная функция описывается следующим образом:\n Q(L, K) = 1 + KL/(1 + KL/(1 + KL/(1 + KL/(1 + ...)))) $$\nКаждую произведённую единицу продукции предприниматель может реализовать по цене 5, которую он принимает как заданную. Найдите, сколько единиц продукции продаст предприниматель, если он стремится максимизировать свою прибыль.",
        "6"
    ],
    [
        "Задача 5. (Александр Шиваров) \nНа рынке совершенной конкуренции, с функциями спроса и предложения Q_{d}=200-P и Q_{s}=P соответственно, государство устанавливает потолок цен P_{cell}=50\nНайдите рыночные DWL, если известно, что те кто готов заплатить за товар больше - ценят своё время больше, а соответственно не готовы стоят в очереди и им не достаётся товар.",
        "7500"
    ],
    [
        "Задача 6. (Александр Шиваров) \nЭкономика страны состоит из двух регионов и умеет производить только товары Х и Y. В производстве используется только труд, а производственные функции двух регионов выглядят следующим образом:\nпервый регион - Y=√(L_y), X=(√(L_x))/5\nвторой регион - Y=(√(L_y))/5, X=√(L_x)\nЗапасы труда в стране ограничены L=150, найдите площадь с точностью до десятых под КПВ страны при условии, что труд абсолютно мобилен.",
        "122.5"
    ],
    [
        "Задача 7. (Ярослав Лисняк) \nУ вас есть 10 массивов с данными, по которым нужно вывести зависимость между ценой продукта и величиной спроса на данную продукцию. Итоговые зависимости вам известны и нужны именно для того, чтобы проверить 1025 алгоритмов, которые эту зависимость строят. Вы знаете, что среди 1025 есть ровно один плохо работающий алгоритм и вам нужно через 1 день выслать заказчику как можно больше работающих алгоритмов. Каждый алгоритм Вы можете поставить проверяться на каких-либо массивах с данными. Для каждого алгоритма вы 1 раз выбираете то, на каких массивах он будет работать. Бракованный алгоритм выдаст ошибку на любом массиве данных, остальные ошибки не выдадут.\nСколько максимально алгоритмов Вы сможете отправить заказчику, гарантируя то, что ему не попадётся неработающий?",
        "1023"
    ],
    [
        "Задача 8. (Арсений Бекбулатов)\nСтудия СомФильм уже много лет занимается выпуском многосерийных фильмов. К сожалению, получать положительную прибыль ей все никак не удается. Именно поэтому господин Деминский, глава Культмина, решил назначить студии субсидию. Не посоветовавшись с Экономразвитиямин, господин Деминский назначил следующую субсидию: если за год было выпущено X сериалов, фирма будет получать в X раз больше специальных карточек, при этом количество Y этих карточек можно обменять на aY^2+bY рубдей. Издержки студии засекречены, мы знаем лишь то, что они имеют классический канонический вид. Сериалы пользуются огромным спросом среди бабушек, поэтому студия является монополистом.\nПосле введения данной субсидии, глава СомФильма настолько обрадовался, что при составлении плана на год ошибся и поручил бухгалтеру не максимизировать прибыль, а минимизировать издержки. Тем не менее, в конце года он очень удивился, так как в итоге получил максимальную прибыль. Определите изменение значения эластичности спроса по цене в результате субсидирования. В ответ напишите число в процентах.",
        "0"
    ],
    [
        "Задача 9. (Ярослав Лисняк)\nВсе персонажи выдуманы, все совпадения случайны.\nКанун выборов в 2120-м году. Голоса всех избирателей равномерно распределены на отрезке [0 , 1]. В точке 0 и близко к ней сконцентрированы патриоты, обожающие геополитику и утягивание поясов, в точке 1 и близко к ней напротив, скопилась оппозиция. Патриотов в стране больше, поэтому первая половина отрезка в два раза плотней по концентрации голосов, чем вторая. Другими словами, отрезок x принадлежащий [0, 0.5] ценится как отрезок длинной 2x из куска [0.5, 1]. Есть 3 кандидата: Пупа, Лупа и Дядя Лёша. Они выбирают, какую политическую позицию им занять. Другими словами они выбирают точку на отрезке. Каждый житель на отрезке голосует за кандидата с ближайшими взглядами. Если чей-то голос одинаково близок по позиции к нескольким кандидатом, то голос достаётся им поровну. Таким образом, когда кандидаты выбрали свои позиции, можно посчитать их голоса как длины соответствующих отрезков. Пример для двух кандидатов на прикреплённой картинке.\nВернёмся к нашим трём кандидатам. Каждый из них стремится получить как можно больше голосов и они выбирают свои позиции одновременно. Сколько существует равновесий в этом взаимодействии? ",
        "0"
    ],
    [
        "Задача 10. (Иван Дедюхин) \nГород имеет форму плоскости с центром в точке (6;8). Склад фирмы 'ШЭВ' находится в начале координат. Фирма 'ШЭВ' выбирает место для магазина в городе. Пусть a - расстояние от магазина до центра города, а b - расстояние от склада до магазина, тогда количество проданных единиц товара Q = (10 - a)L (потому что чем дальше магазин от центра, тем менее квалифицированы кадры). Зарплата одного работника магазина равна 1/2. Суммарные издержки на транспортировку от склада до магазина составляют √b и не зависят от объёма поставок. На складе имеется бесконечное количество товара.\nВыведите общие издержки TC(Q), если магазин должен находится в пределах города и максимизирует прибыль!\nВ ответ запишите сумму общих издержек с точностью до десятых в точках Q=729 и Q=1331",
        "83.2"
    ],
    [
        "Задача 11.\nРазочаровавшись в экономике и программировании, Игорь ушёл в математику - в искусство. Теперь он известный художник и рисует картины. К сожалению, Игорь делает это очень плохо, потому что умеет лишь рисовать прямые линии, но благодаря своему экономическому прошлому, он умеет находить и объяснять во всём этом смысл. Так, если его прямые разбивают полотно на i кусочков, то его картину оценивают в i. Будем считать, что Игорь не несёт никаких издержек, кроме покупки полотен, а если он покупает Q полотен (Q-целое), то его издержки можно выразить как TC=Q^2. Найдите максимальную прибыль, которую может получить Игорь, если он - человек строгих правил, и на каждой картине рисует ровно 100 прямых.",
        "6378150"
    ],
    [
        "Задача 12.\nФункция дефицита на рынке шведских блюд в некотором пансионате задается следующим соотношением:Def=(20-5P^20)/(2P^5+P^15)\nТакже известно, что для всех возможных P_D и P_S выполняется равенство |E_{P_D}^D*E_{P_S}^S|=const, где E_{P_D}^D -- эластичность спроса по цене спроса, E_{P_S}^S -- эластичность предложения по цене предложения, а const -- некоторая константа. Сколько всего возможных пар спросов и предложений, которые могут быть на рынке шведских блюд?",
        "1"
    ],
    [
        "Задача 13. (Александр Шиваров) \nНекий Господин Н, хочет избавиться от партии воров и вокилуж, победив их на выборах в парламент, то есть сделать так, чтобы больше половины парламента составляли его кандидаты. Известно, что в парламент войдут 100 человек, набравших наибольшее число голосов на голосовании, при этом если два кандидата набрали одинаковое число голосов, то предпочтение отдаётся кандидату из партии воров и вокилуж. Пусть у воров и вокилуж есть 1000 голосов, которые они могут распределить между неограниченным числом своих кандидатов, при этом с помощью подтасовок результатов, партия может увеличить количество голосов за каждого кандидата на  не более чем на 50%.\nКакое наименьшее суммарное количество голосов должен привлечь господин Н. для своей 'умной’ системы голосования, чтобы наверняка победить, если его кандидаты так же имеются в неограниченном количестве, но, к сожалению 30% (или меньше) из тех, кто войдёт в парламент - подставные, то есть придадут его и присоединятся к партии воров и вокилуж?\n(Будем считать, что партия знает о предателях, но не знает кто именно ими является, а число людей может быть выражено только целым числом)",
        "3744"
    ],
    [
        "Задача 14. Некоторый фонд, назовём его WFW, занимается только тремя вещами: покупает оружие, собирает пожертвования, продаёт всё купленное оружие.\nИзвестно, что закупает и продаёт оружие фонд на двух разных совершенно-конкурентных рынках, на которых уже успели сформироваться спрос и предложение, причем одинаковые на обоих рынках. (Функции спроса и предложения совпадают)\nWFW - честная организация и поэтому, всё что она получает - она тратит. (То есть сумма доходов равна сумме расходов). А так же, фонд всё равно стремится получить как можно большую выручку на продаже оружия.\nНайдите чему равны пожертвования в фонд, если его расходы на покупку оружия равны 600, спрос и предложение на рынках линейный, причём предложение имеет постоянную эластичность по цене.",
        "400"
    ]
]